{
  "about_us": {
    "company_name": {
      "en": "Geeks Production Studio",
      "zh": "Geeks Production Studio"
    },
    "mission": {
      "en": "To revolutionize F1 boardgame through innovative mechanisms to bring out the best of F1 racing characteristics to our passionate fans.",
      "zh": "通过创新机制彻底改变F1桌游，为我们的车迷朋友们带来F1的情怀。"
    },
    "description": {
      "en": "Delta Dash is developed by passionate motorsports enthusiasts and boardgame designers who believe that motorsports boardgames should illustrate the true essence of the particular racing event to the largest extent without running against legal regulations.",
      "zh": "Delta Dash由热情的赛车运动爱好者和桌游设计师开发，他们相信赛车运动桌游应该最大程度地展现特定赛车赛事的真实本质，同时不违反法律规定。"
    },
    "team": [
      {
        "img_src": "https://www.autoracing1.com/wp-content/uploads/2023/f1/bahraintest/pirellitires.jpg",
        "title": {
          "en": "Most Delicate Strategy Management",
          "zh": "最极致的策略管理"
        },
        "date": {
          "en": "'M-M-H-S' I'm genius!",
          "zh": "'黄黄白红'也不是不行"
        },
        "content": {
          "en": "Though a boardgame, the strategy management is as sophisticated as the racing event itself but not so regulated. Feel free to press your luck on your own strategies even if they seem insane in real life!",
          "zh": "虽是桌游，但保留了精细的策略系统，同时也不如现实的那样限制过多，你总是可以尝试最疯狂的策略，出奇制胜！"
        }
      },
      {
        "img_src": "assets/memes.png",
        "title": {
          "en": "Most Amusing Memes",
          "zh": "最有趣的梗图"
        },
        "date": {
          "en": "'Must be the water'",
          "zh": "'状态奇佳，大杀四方'"
        },
        "content": {
          "en": "What makes a game fun? The most sophisticated game will not impress our passionate fans as much as a game with the best memes!",
          "zh": "什么样的游戏最有趣？不是制作最精良的游戏，而是最有梗的游戏！"
        }
      },
      {
        "img_src": "assets/DLC_teamwork.jpg",
        "title": {
          "en": "Most Compatible with Extensions",
          "zh": "最兼容扩展"
        },
        "date": {
          "en": "You can always trust a DLC",
          "zh": "遇事不决，外挂解决"
        },
        "content": {
          "en": "Do not ever worry if the game is too simple or not sphisticated enough - our design reserves slot for official AND civil expansions for the game, making it customized to fit the needs of our fans.",
          "zh": "假如你对现有的游戏不满意，我们还提供大量的官方和民间扩展包增设空间，实现游戏的定制化。"
        }
      }
    ],
   
    "contact": {
      "email": "ljl.leo7@gmail.com",
      "bilibili": {
        "text": "开飞机的莱科宁",
        "url": "https://space.bilibili.com/2042750791?spm_id_from=333.1007.0.0"
      }
    }
  }
}