[
  {
    "name": "Delta Dash Version 3.1 Beta",
    "date": "Jan 1, 2026",
    "brief": "The first BETA test stage, involving refined UI and game structure.",
    "description": "Version 3.1 Beta introduces a polished user interface and multiple refinements to the gameplay loop."
  },
  {
    "name": "Delta Dash Version 3.0 Alpha",
    "date": "Dec 1, 2025",
    "brief": "Base version for Delta Dash 3.0 structure, with updates on track and UI.",
    "description": "Version 3.0 Alpha is the foundational release for the 3.x series.\n\nHighlights: core rule refactor, race track re-design, improved component layout and a base implementation for online matchmaking. This alpha focuses on establishing stable game rules and internal data models.\n\nNotes for playtesters: expect rough edges in the user interface. The Alpha stage is primarily for testing core balance and identifying critical bugs before wider beta testing."
  },
  {
    "name": "Formula Champion 2.1 Alpha",
    "date": "Oct 5, 2025",
    "brief": "Last version of Formula Champion before rebranding to Delta Dash; includes bug fixes and minor improvements.",
    "description": "Version 2.1 Alpha focuses on bug fixes and minor improvements based on previous Alpha version tests, with the largest testing team ever occurred in the history of Geeks Production Studio."
  },
  {
    "name": "Formula Champion 2.0 Alpha",
    "date": "Aug 10, 2025",
    "brief": "Major overhaul introducing new mechanics based on fans' interests.",
    "description": "Version 2.0 Alpha introduces significant changes to the core mechanics of Formula Champion, including a completely new gameplay mechanism, entirely refactored rule description and UI, introducing the 'delta' mechanism which turned the players' focus from pure racing to strategic resource management, also contributing to today's brand 'Delta Dash'."
  },
  {
    "name": "Formula Champion 1.3 Alpha",
    "date": "Jun 10, 2025",
    "brief": "Last version of Formula Champion before the 'delta' mechanism introduction, a final judgement of the original mechanism.",
    "description": "Version 1.2 Alpha was said to be the final version of Formula Champion before release, but due to the negative feedbacks regarding the original mechanics, the development team decided to rework the entire game mechanics, leading to the birth of 2.0 and later versions and the awful reputation of the studio due to 'lack of progress management'."
  }
]
